const express = require('express');
const app = express();

const recipes = [
  {
    id: 1,
    name: 'Бауырсақ',
    ingredients: ['ұн', 'сүт', 'ашытқы', 'шекер', 'тұз', 'cұйық май'],
    instructions: 'лкендеу табаққа шекерді ашытқыны салып үстіне сүтті жылытып құйыңыз да 10 минтуқа қалдырыңыз. 10 минуттан соң тұзды салыңыз, сұйық майды құйып араластырыңыз, ұнды салып жұмсақтау қамыр илеңіз. Қамыр қолға жабыспайтындай етіп жақсылап илеп болған соң, жылы орап қойыңыз. 30 - 40 минуттан соң бір рет қайыра илеп, 10 - 15 минутқа қалдырыңыз. Дайын болған қамырды алып қалыңдығын 1 см етіп жайыңыз да майдалап кесіңіз немесе ойғышпен дөңгелектеп ойыңыз, көпсу үшін 10 минутқа орамалмен бетін жауып қойыңыз. Оған дейін шұңғылдау ыдысқа сұйық майды құйып қыздырыңыз, бауырсақ бататындай болсын, сонда тегіс қызарып әдемі болып піседі.'
  },
  {
    id: 2,
    name: 'Сірне',
    ingredients: ['сиыр еті', 'сұйық май', 'пияз', 'аскөк', 'тұз', 'бұрыш', 'қою қаймақ', 'картоп', 'сəбіз'],
    instructions: 'Төлдің етін ірілеп турайсыз, сүйегінде мүмкіндігінше бөлу керек. Қазанға 1 литрдей сұйық май құйып, əбден қызған кезде туралған етті сүйегімен саласыз. Жақсылап қуырылған еттің үстіне дəмдеуіштер яғни пияз, аскөк, көк пиязды да салып, қажетінше бұрыштап, тұздайсыз. Кішкене қуырып артынша қою қаймақ немесе жаңа сауған бие сүтін құйып, буын шығармай бетін жақсылап бекітіп, 40-45 минут демдейсіз. Қаймақпен саумалдың орнына ірі етіп туралған картоп пен сəбіз қоссада болады. Буға піскен сірнені дастарқанға түсіре беруге болады.'
  },
  {
    id: 3,
    name: 'Қуырдақ',
    ingredients: ['қой еті', 'өкпелері', 'бауыры', 'пияз', 'қара бұрыш', 'картоп', 'сарымсақ', 'көкшөп', 'лавр жапырақтары', 'құйрық майы'],
    instructions: 'Алдымен ас даярлайтын қазанды қыздырып, құйрық майын қуырып алыңыз. Ол уақытта жүрек, бауыр мен өкпелерді жуандығы 2-3 см бөліктерге турай беріңіз. Құйрық майы ерігеннен кейін оның бөлшектерін қазаннан алып тастап, қазанға жүрек пен өкпе етін салыңыз. Бауыр етін кейінірек салған жөн, себебі ол тез піседі. Пиязды сақина етіп турап, қуырылып жатқан етке қосамыз. Барлығын жақсылап араластырамыз. Әрі қарай көкшөп пен сарымсақты ұсақтап турап, қазандағы тағамға қосамыз. Бұрышын қосып, тұздап, қайта араластырамыз. Жарты сағат көлемінде орташа отта бұқтырып пісіреміз. Ол уақыт ішінде картопты кішірек қылып турап, бауырмен бірге қазанға саламыз. Соңғы ингредиенттерді салып біткеннен кейін тағамымызға 150 мл су қосып, отын көтеріп, әрі қарай пісіреміз. Қуырдақтың дайын болғандығын картоптың піскенімен біле аламыз.'
  }
];

app.use(express.json());

app.post('/recipes', (req, res) => {
  const selectedIngredients = req.body.ingredients;
  const matchingRecipes = recipes.filter(recipe => selectedIngredients.every(ingredient => recipe.ingredients.includes(ingredient)));

  res.json(matchingRecipes);
});

app.listen(3000, () => {
  console.log('Server is running on port 3000');
});

// app.get('/', (req, res) => {
//   res.send('Hello, World!');
// });

app.get('/recipes/:ingredient', (req, res) => {
  const ingredient = req.params.ingredient;
  const matchingRecipes = recipes.filter(recipe => recipe.ingredients.includes(ingredient));

  res.json(matchingRecipes);
});
